smp-client/docs/A02_CVB_Step1_New_Subscriber_SOAP.xml

<!-- $Id: A02_CVB_Step1_New_Subscriber_SOAP.xml,v 1.1 2009/11/23 13:29:20 varshag Exp $ -->
<!--
A02_CVB_Step1_New_Subscriber_SOAP.xml

This request will come from TRIPLE.


This is scenario where we will be adding new subscriber along with servicess

Following services will be created:
1. Subscriber, Contact, address
2. Cable Broadband service with following child services
	- internet_access
	- std_cpe
3. Voice service with following child services
	- smp_switch_dial_tone_access
	- smp_switch_feature_pkg_std
-->
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<m:executeXml xmlns:m="http://www.sigma-systems.com/schemas/3.1/SmpXmlOrderAPI" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <xmlRequest xsi:type="xsd:string">&lt;smpsa:executeOrderRequest xmlns:smpsa=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:cmn=&quot;http://java.sun.com/products/oss/xml/Common&quot; xmlns:sa=&quot;http://java.sun.com/products/oss/xml/ServiceActivation&quot; xmlns:smpcmn=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCommonValues&quot; xmlns:smpcbe=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xmlns:cbesvc=&quot;http://java.sun.com/products/oss/xml/CBE/Service&quot;&gt;
  &lt;smp:orderValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; xsi:type=&quot;smp:SnapshotOrderValue&quot;&gt;
    &lt;cmn:lastUpdateVersionNumber&gt;-1&lt;/cmn:lastUpdateVersionNumber&gt;
    &lt;sa:apiClientId&gt;TRIPLE&lt;/sa:apiClientId&gt;
    &lt;sa:orderKey xsi:type=&quot;smp:OrderKeyType&quot;&gt;
      &lt;cmn:type&gt;com.sigma.samp.cmn.order.SampOrderKey&lt;/cmn:type&gt;
      &lt;sa:primaryKey&gt;-1&lt;/sa:primaryKey&gt;
    &lt;/sa:orderKey&gt;
    &lt;sa:priority&gt;3&lt;/sa:priority&gt;
    &lt;sa:orderState smpState=&quot;open.not_running.not_started&quot; xsi:type=&quot;smp:SubOrderStateType&quot;&gt;open.not_running.not_started&lt;/sa:orderState&gt;
    &lt;smp:orderParamList&gt;
      &lt;smpcmn:param name=&quot;queue_request_flag&quot;&gt;yes&lt;/smpcmn:param&gt;
      &lt;smpcmn:param name=&quot;has_groups&quot;&gt;yes&lt;/smpcmn:param&gt;
    &lt;/smp:orderParamList&gt;
    &lt;smp:subscriber serviceProvider=&quot;YouSee&quot; subscriberType=&quot;residential&quot; locale=&quot;en_CA&quot;&gt;
      &lt;smp:key xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubKeyType&quot;&gt;
        &lt;cmn:type&gt;SubSpec:-&lt;/cmn:type&gt;
        &lt;smp:externalKey&gt;4444444444424&lt;/smp:externalKey&gt;
      &lt;/smp:key&gt;
      &lt;smpcbe:state&gt;active&lt;/smpcbe:state&gt;
      &lt;smpcbe:paramList&gt;
        &lt;smpcbe:param name=&quot;acct&quot;&gt;4444444444424&lt;/smpcbe:param&gt;
      &lt;/smpcbe:paramList&gt;
      &lt;smpcbe:entityList&gt;
        &lt;smp:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; addressType=&quot;service&quot; isDefault=&quot;true&quot; xsi:type=&quot;smp:SubAddressType&quot;&gt;
          &lt;smp:key xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
            &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
          &lt;/smp:key&gt;
          &lt;smp:state&gt;inactive&lt;/smp:state&gt;
          &lt;smp:paramList&gt;
            &lt;smp:param name=&quot;ntd_return_segment_nm&quot;&gt;165&lt;/smp:param&gt;
            &lt;smp:param name=&quot;zipcode&quot;&gt;77864&lt;/smp:param&gt;
            &lt;smp:param name=&quot;address1&quot;&gt;PUNE&lt;/smp:param&gt;
            &lt;smp:param name=&quot;address2&quot;&gt;PUNE&lt;/smp:param&gt;
            &lt;smp:param name=&quot;district&quot;&gt;PUNE&lt;/smp:param&gt;
          &lt;/smp:paramList&gt;
        &lt;/smp:entityValue&gt;
        &lt;smp:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubContactType&quot;&gt;
          &lt;smp:key xsi:type=&quot;smp:SubContactKeyType&quot;&gt;
            &lt;cmn:type&gt;SubContactSpec:-&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
          &lt;/smp:key&gt;
          &lt;smp:state&gt;inactive&lt;/smp:state&gt;
          &lt;smp:paramList&gt;
            &lt;smp:param name=&quot;first_name&quot;&gt;SIGMA&lt;/smp:param&gt;
            &lt;smp:param name=&quot;phones.cell.number&quot;&gt;576067048457&lt;/smp:param&gt;
            &lt;smp:param name=&quot;phones.business.number&quot;&gt;567958967&lt;/smp:param&gt;
            &lt;smp:param name=&quot;last_name&quot;&gt;PUNE&lt;/smp:param&gt;
            &lt;smp:param name=&quot;phones.business.extension&quot;&gt;6790586&lt;/smp:param&gt;
            &lt;smp:param name=&quot;phones.home.number&quot;&gt;3457456456&lt;/smp:param&gt;
            &lt;smp:param name=&quot;emails.home.address&quot;&gt;sigmasystem.com&lt;/smp:param&gt;
	    &lt;/smp:paramList&gt;
          &lt;smp:associationList&gt;
            &lt;smp:association&gt;
              &lt;smp:associationType&gt;contact_on_address&lt;/smp:associationType&gt;
              &lt;smp:zEndKey xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
              &lt;/smp:zEndKey&gt;
              &lt;smp:changeAction&gt;add&lt;/smp:changeAction&gt;
            &lt;/smp:association&gt;
          &lt;/smp:associationList&gt;
        &lt;/smp:entityValue&gt;
        &lt;smpcbe:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;inactive&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;inactive&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:samp_sub&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;samp_sub_20000&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:paramList&gt;
        &lt;smpcbe:param name=&quot;acct&quot;&gt;4444444444424&lt;/smpcbe:param&gt;
          &lt;/smp:paramList&gt;
          &lt;smp:associationList&gt;
            &lt;smpcbe:association&gt;
              &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
              &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
              &lt;/smp:zEndKey&gt;
              &lt;smpcbe:changeAction&gt;add&lt;/smpcbe:changeAction&gt;
            &lt;/smpcbe:association&gt;
          &lt;/smp:associationList&gt;
        &lt;/smpcbe:entityValue&gt;
        &lt;smpcbe:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:childServiceList&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_switch_dial_tone_access&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_switch_dial_tone_access_10001&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
                &lt;smpcbe:param name=&quot;rate_codes&quot;&gt;silver&lt;/smpcbe:param&gt;
                &lt;smpcbe:param name=&quot;telephone_number&quot;&gt;7467435345&lt;/smpcbe:param&gt;
                &lt;smpcbe:param name=&quot;dial_tone_service_id&quot;&gt;10001&lt;/smpcbe:param&gt;
                &lt;smpcbe:param name=&quot;mta_voice_port&quot;&gt;1&lt;/smpcbe:param&gt;
                &lt;smpcbe:param name=&quot;privacy&quot;&gt;FULL&lt;/smpcbe:param&gt;
                &lt;smpcbe:param name=&quot;cos_restrict_id&quot;&gt;4&lt;/smpcbe:param&gt;
              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                  &lt;smpcbe:changeAction&gt;add&lt;/smpcbe:changeAction&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_switch_feature_pkg_std&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_switch_feature_pkg_std_4444444444424&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:smp_voice_line&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;smp_voice_line_10004&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
				 &lt;smpcbe:param name=&quot;switch_feature_service_id&quot;&gt;10002&lt;/smpcbe:param&gt;
              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                  &lt;smpcbe:changeAction&gt;add&lt;/smpcbe:changeAction&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
          &lt;/smp:childServiceList&gt;
        &lt;/smpcbe:entityValue&gt;
        &lt;smpcbe:entityValue xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBEServiceSchema&quot; xsi:type=&quot;smp:SubSvcType&quot;&gt;
          &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
          &lt;smp:serviceKey&gt;
            &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
            &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
          &lt;/smp:serviceKey&gt;
          &lt;smp:childServiceList&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:internet_access&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;internet_access_20002&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
                &lt;smpcbe:param name=&quot;broadband_service_id&quot;&gt;20001&lt;/smpcbe:param&gt;
               &lt;smpcbe:param name=&quot;rate_codes&quot;&gt;silver&lt;/smpcbe:param&gt;
              &lt;/smp:paramList&gt;
              &lt;smp:associationList&gt;
                &lt;smpcbe:association&gt;
                  &lt;smpcbe:associationType&gt;service_on_address&lt;/smpcbe:associationType&gt;
                  &lt;smp:zEndKey xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpCBECoreSchema&quot; xsi:type=&quot;smp:SubAddressKeyType&quot;&gt;
                    &lt;cmn:type&gt;SubAddressSpec:-&lt;/cmn:type&gt;
                    &lt;smp:externalKey&gt;primary&lt;/smp:externalKey&gt;
                  &lt;/smp:zEndKey&gt;
                  &lt;smpcbe:changeAction&gt;add&lt;/smpcbe:changeAction&gt;
                &lt;/smpcbe:association&gt;
              &lt;/smp:associationList&gt;
            &lt;/smp:serviceValue&gt;
            &lt;smp:serviceValue&gt;
              &lt;cbesvc:serviceState xmlns:smp=&quot;http://www.sigma-systems.com/schemas/3.1/SmpServiceActivationSchema&quot; provisionState=&quot;active&quot; xsi:type=&quot;smp:SubSvcStateType&quot;&gt;active&lt;/cbesvc:serviceState&gt;
              &lt;smp:serviceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:std_cpe&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;std_cpe_20003&lt;/smp:externalKey&gt;
              &lt;/smp:serviceKey&gt;
              &lt;smp:parentServiceKey&gt;
                &lt;cmn:type&gt;SubSvcSpec:cable_broadband&lt;/cmn:type&gt;
                &lt;smp:externalKey&gt;cable_broadband_20001&lt;/smp:externalKey&gt;
              &lt;/smp:parentServiceKey&gt;
              &lt;smp:paramList&gt;
                &lt;smpcbe:param name=&quot;cpe_service_id&quot;&gt;20003&lt;/smpcbe:param&gt;
              &lt;/smp:paramList&gt;
            &lt;/smp:serviceValue&gt;
          &lt;/smp:childServiceList&gt;
        &lt;/smpcbe:entityValue&gt;
      &lt;/smpcbe:entityList&gt;
    &lt;/smp:subscriber&gt;
  &lt;/smp:orderValue&gt;
&lt;/smpsa:executeOrderRequest&gt;</xmlRequest> 
  </m:executeXml>
  </SOAP-ENV:Body>
  </SOAP-ENV:Envelope>